# NewPointRelativeToPoint Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Application..::..NewPointRelativeToPoint Method
Application Class See Also
---
Create a PointRelativeToPoint object, which is used to define the placement of a ReferencePoint relative to a host point.
**Namespace:** Autodesk.Revit.Creation**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public PointRelativeToPoint NewPointRelativeToPoint(
	Reference hostPointReference
)
```

Visual Basic
---
```text
Public Function NewPointRelativeToPoint ( _
	hostPointReference As Reference _
) As PointRelativeToPoint
```

Visual C++
---
```text
public:
PointRelativeToPoint^ NewPointRelativeToPoint(
	Reference^ hostPointReference
)
```

# ### Parameters
hostPointReference
    Type: Autodesk.Revit.DB..::..ReferenceThe reference of the host point.
# ### Return Value
If creation is successful then a new PointRelativeToPoint object is returned, otherwise an exception with failure information will be thrown.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | Thrown when the input argument hostPointReference is nullNothingnullptra null reference (Nothing in Visual Basic). |

# See Also
Application Class
Autodesk.Revit.Creation Namespace